Tekla Open API Reference for Tekla Structures 2025
ErrorDialog.Show Method
Overload List
Name | Description
Show(Exception, ErrorDialog.Severity)
 Shows a new error dialog.
Show(String, List<String>, ErrorDialog.Severity)
 Shows a new error dialog.
Show(String, String, ErrorDialog.Severity)
 Shows a new error dialog.
Top
See Also
Reference
ErrorDialog Class
Tekla.Structures.Dialog Namespace